app/views/blogs/_table.html.erb

          <span><i class="fas fa-user"><%= blog.user.name %> | </i></span>
          <span>コメント数：<%= blog.blog_comments.count %></span>
---
SELECT COUNT(*) FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 1]]