app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 1]]
---
    <p class="fas fa-heart heart_red">
    <%= blog.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 2]]
---
    <p class="fas fa-heart heart_blue">
    <%= blog.favorites.count %>