app/controllers/blog_comments_controller.rb

  def create
    @blog = Blog.find(params[:blog_id])
    @blog_comment = BlogComment.new(blog_comment_params)
    @blog_comment.blog_id = @blog.id
    @blog_comment.user_id = current_user.id
    @blog_comments = @blog.blog_comments
    unless @blog_comment.save
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "blog_comments" ("comment", "user_id", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ああああああああ"], ["user_id", 2], ["blog_id", 1], ["created_at", "2021-12-10 02:41:16.279323"], ["updated_at", "2021-12-10 02:41:16.279323"]]

  def destroy
    @blog = Blog.find(params[:blog_id])
    blog_comment = @blog.blog_comments.find(params[:id])
    blog_comment.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."blog_id" = ? AND "blog_comments"."id" = ? LIMIT ?  [["blog_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "blog_comments" WHERE "blog_comments"."id" = ?  [["id", 1]]