app/controllers/blogs_controller.rb

  def index
    @total_blogs = Blog.all
    @blogs = Blog.all.page(params[:page]).per(8)
---
SELECT  "blogs".* FROM "blogs" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]

  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id
    if @blog.save
---
INSERT INTO "blogs" ("title", "body", "user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @blog = Blog.find(params[:id])
    if @blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "blogs" SET "image_id" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["image_id", "98b591a726d0a1494e3d193706b5108204aef19ffc46baa010047944fe55"], ["updated_at", "2021-12-22 04:58:45.829829"], ["id", 2]]

  def correct_user
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]