app/controllers/favorites_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["blog_id", 1], ["created_at", "2021-12-22 04:56:19.145340"], ["updated_at", "2021-12-22 04:56:19.145340"]]
---
  def create
    @blog = Blog.find(params[:blog_id])
    favorite = @blog.favorites.new(user_id: current_user.id)
    favorite.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."blog_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["blog_id", 1], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
    @blog = Blog.find(params[:blog_id])
    favorite = @blog.favorites.find_by(user_id: current_user.id)
    favorite.destroy