app/controllers/users_controller.rb

  def index
    @users = User.all.page(params[:page]).per(10)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "ec061983492fae848e8d80ca0e4820ec4cfa1782309fdc06c8ae4dd5480d"], ["updated_at", "2021-12-22 04:54:28.739492"], ["id", 2]]