app/views/blog_comments/_index.html.erb

<% blog.blog_comments.each do |blog_comment| %>
---
SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 1]]